# Pandas:Selecting data in a Dataframe

In [15]:
import pandas as pd

#Define a dictionary 'x'

x = {'Name': ['Rose','John', 'Jane', 'Mary'], 'ID': [1, 2, 3, 4], 'Department': ['Architect Group', 'Software Group', 'Design Team', 'Infrastructure'], 
      'Salary':[100000, 80000, 50000, 60000]}

#casting the dictionary to a DataFrame
df = pd.DataFrame(x)

#display the result df
df

   Name  ID       Department  Salary
0  Rose   1  Architect Group  100000
1  John   2   Software Group   80000
2  Jane   3      Design Team   50000
3  Mary   4   Infrastructure   60000

In [16]:
import pandas as pd

#Define a dictionary 'info'
info = {'Student':['David','Samuel','Terry','Evan'],'Age':[27,24,22,32],'Country':['UK','Canada','China','USA'],'Course':['Python','Data Structures','Machine Learning','Web Development'],'Marks':[85,72,89,76]}

#casting the dictionary to a DataFrame
df=pd.DataFrame(info)

#display the result df
df

  Student  Age Country            Course  Marks
0   David   27      UK            Python     85
1  Samuel   24  Canada   Data Structures     72
2   Terry   22   China  Machine Learning     89
3    Evan   32     USA   Web Development     76

In [17]:
#Retrieve the Marks column and assign it to a variable b
b = df[['Marks']]
b

   Marks
0     85
1     72
2     89
3     76

In [18]:
#Retrieve the Country and Course columns and assign it to a variable c
c = df[['Country','Course']]
c

  Country            Course
0      UK            Python
1  Canada   Data Structures
2   China  Machine Learning
3     USA   Web Development

In [20]:
# Get the Student column as a series Object

x = df['Student']
x

0     David
1    Samuel
2     Terry
3      Evan
Name: Student, dtype: object

In [21]:
import pandas as pd
x = {'Name': ['Rose','John', 'Jane', 'Mary'], 'ID': [1, 2, 3, 4], 'Department': ['Architect Group', 'Software Group', 'Design Team', 'Infrastructure'], 
      'Salary':[100000, 80000, 50000, 60000]}

#casting the dictionary to a DataFrame
df = pd.DataFrame(x)

#set the "Name" column as an index column
df1=df
df1=df1.set_index('Name')

#Use the loc() function,to get the Department of Jane in the newly created dataframe df1.
x=df1.loc['Jane','Department']
x

'Design Team'

In [22]:
#Use the iloc() function,to get the Salary of Mary in the newly created dataframe df1.
x=df1.iloc[3,2]
x

60000

In [24]:
#slicing

x=df.loc[0:3,'Name':'Department']
x

   Name  ID       Department
0  Rose   1  Architect Group
1  John   2   Software Group
2  Jane   3      Design Team
3  Mary   4   Infrastructure

In [25]:
#slicing

y= df.iloc[0:3,0:2]
y

   Name  ID
0  Rose   1
1  John   2
2  Jane   3